       *exercice
       *écris un programme qui demande deux nombres à l'utilisateur et qui affiche leur somme
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SommeDeuxNombres.
       PROCEDURE DIVISION.
       DISPLAY 'Hello, COBOL world!'.
       STOP RUN.
