       program-id. HelloWorld.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           DISPLAY "Hello My Friends!!!!"
           goback.

       end program HelloWorld.
